{"pageText":{"title":"Spawn of Trouble: ACA style Step 10","subTitle":"Spiritual Principles: Honesty and Discernment","collapsedText":["\"Many of us found that we had several characteristics in common as a result of being brought up in an alcoholic or dysfunctional household. \"","This is a tool for doing daily inventory to keep current with our recovery from the affects of growing up with disfunction or trauma. You can fill out all the sections, or just the ones that speak to you."]},"traitList":[{"Q":"Did I isolate and not talk about what was really going on with me?","A":"I isolated or didn't talk about what was really going on with me. "},{"Q":"Did I view anyone as an authority figure today and feel frightened or rebellious?","A":"I viewed someone as an authority figure and felt frightened or rebellious."},{"Q":"Did I dissociate, fantasize, or become involved in self-harm today?","A":"I dissociated, fantasized, or became involved in self-harm."},{"Q":"Did I keep secrets and feel unique?","A":"I kept secrets and felt unique."},{"Q":"Did I talk about my feelings? ","A":"I talked about my feelings."},{"Q":"Was I honest in my relationships?","A":"I was honest in my relationships."},{"Q":"Did I seek approval over honesty?","A":"I sought approval over honesty."},{"Q":"Did I act \"perfect\" and obsess over making mistakes?","A":"I acted \"perfect\" or obsessed over making mistakes."},{"Q":"Did I overreact or isolate from others when I perceived that I was criticized?","A":"I overreacted or isolated from others when I perceived that I was criticized."},{"Q":"Did I attend a meeting to nurture myself and to give back what was given to me?","A":"I attended a meeting to nurture myself and to give back what was given to me."},{"Q":"Have I acted \"helpful\" recently to manipulate others?","A":"I acted \"helpful\" to manipulate others."},{"Q":"Am I secretly angry at someone, but avoiding talking about it?","A":"I was secretly angry at someone, but avoided talking about it."},{"Q":"Have I listened to my Inner Child or True Self today?","A":"I listened to my Inner Child or True Self."},{"Q":"Did I judge myself or someone else without mercy today?","A":"I judged myself or someone else without mercy."},{"Q":"Am I listening to my inner Critical Parent today?","A":"I listened to my inner Critical Parent today."},{"Q":"Am I listening to my inner Loving Parent today?","A":"I listened to my inner Loving Parent today."},{"Q":"Did I remember that I can ask for help today and that I can call someone?","A":"I remembered that I can ask for help and that I can call someone."}],"choiceLevels":{"Denial":0,"Between Denial and Some Choice":16.5,"Some Choice":33,"Between Some Choice and Greater Choice":49.5,"Greater Choice":66,"Between Greater Choice and Discernment":82.5,"Discernment":99},"feelings":["Abandoned","Accepted","Ambivalent","Angry","Ashamed","Betrayed","Confident","Confused","Content","Disappointed","Embarrassed","Enthralled","Excited","Frustrated","Fascinated","Grateful","Guilty","Grief","Humiliated","Humorous","Hopeful","Inspired","Irritated","Joyful","Loving","Loved","Playful","Pleased","Pleasure","Rested","Safe","Satisfied","Shame","Serene","Tenacious","Trusted","Thoughtful"],"assets":["A Friend","A Listener","Accepting","Compassionate","Courteous","Creative","Hard Working","Honest","Humorous","Intelligent","Judicious","Kind","Loving","Modest","Organized","Prompt","Sensitive","Spiritual","Strong","Talented","Tenacious","Trustworthy","Willing"],"laundryLists":[["I isolated and was afraid of people.","I exploited my authority to frighten others."],["I sought approval, at the expense of my identity.","I was rigidly self-sufficient."],["I was frightened by an angry person or personal criticism.","I frightened people with anger or threat of belittling criticism."],["I chose someone unavailable.","I was an abandoner / isolator."],["I was victim minded.","I was victimizing."],["I felt overly responsible for others.","I was irresponsible and self-centered."],["I felt guilty standing up for myself.","I encouraged guilt in others to get my way."],["I was addicted to excitement.","I was emotionally deadened and numb."],["I confused pity with love.","I hated an needy person."],["I stuffed or stifled feelings. [denial]","I dramatically over expressed feelings. [denial]"],["I judged myself harshly.","I judged someone else harshly."],["I was dependent or clingy in a relationship.","I was overly independent, and avoided intimacy."],["I expressed alcoholic/addictive tendencies, with or without alcohol or drugs.","I refused to accept being affected by growing up around addiction, dysfunction or trauma."],["I was reactive, letting others direct my decisions.","I was nothing like my dysfunctional family."]]}